/*
匹配身份证
18位
前六位是省市区
7到14位是年月日
最后四位
          // 前两位是
          // 第三位是性别 奇数是男的  偶数是女的
          // 第四位有可能是数字，有可能大写的X

    // '130981 19870313 6015'
*/

//  ?: 只匹配不捕获


let reg = /(\d{6})(\d{8})(\d{4})/;
let reg1 = /(\d{6})(\d{4})(\d{2})(\d{2})(\d{4})/;  //把前六位和中间八位和后四位分开
let reg2 = /(?:\d{6})(\d{4})(0[0-9]|1[0-2])(0[1-9]|[1-2]\d|3[0-1])\d{2}(\d)(?:X|\d)/;
let str = '130981198703136015';
let res = reg2.exec(str);
let sex = '男生';
console.log(`您当前的生日是${res[1]}年${res[2]}月${res[3]}日`);
if(res[4]%2 == 0){
    sex = '女生';
}
console.log(`您的性别是${sex}`);
//月 01-12  01-09 10-12  (0[0-9]|1[0-2])
//日 01-31  01-09 10-29 30-31  (0[1-9]|[1-2]\d|3[0-1])